[
  {
    "title": "How to Start Google",
    "url": "https://paulgraham.com/google.html",
    "date": "March 2024",
    "preview": "March 2024\n(This is a talk I gave to 14 and 15 year olds about what to do now\nif they might want to start a startup later. Lots of schools think\nthey should tell students something about startups. This is what I"
  },
  {
    "title": "The Reddits",
    "url": "https://paulgraham.com/reddits.html",
    "date": "March 2024",
    "preview": "March 2024\nI met the Reddits before we even started Y Combinator. In fact they\nwere one of the reasons we started it.\nYC grew out of a talk I gave to the Harvard Computer Society (the"
  },
  {
    "title": "Great Work",
    "url": "https://paulgraham.com/greatwork.html",
    "date": "February 2024",
    "preview": "July 2023\nIf you collected lists of techniques for doing great work in a lot\nof different fields, what would the intersection look like? I decided\nto find out by making it."
  },
  {
    "title": "Wealth",
    "url": "https://paulgraham.com/wealth.html",
    "date": "February 2024",
    "preview": "Want to start a startup?\n  Get funded by\nY Combinator\n."
  },
  {
    "title": "Superlinear Returns",
    "url": "https://paulgraham.com/superlinear.html",
    "date": "January 2024",
    "preview": "October 2023\nOne of the most important things I didn't understand about the world\nwhen I was a child is the degree to which the returns for performance\nare superlinear."
  },
  {
    "title": "Woke",
    "url": "https://paulgraham.com/woke.html",
    "date": "January 2024",
    "preview": "January 2025\nThe word \"prig\" isn't very common now, but if you look up\nthe definition, it will sound familiar. Google's isn't bad:\n  A self-righteously moralistic person who behaves as if"
  },
  {
    "title": "Best",
    "url": "https://paulgraham.com/best.html",
    "date": "December 2023",
    "preview": "March 2024\nDespite its title this isn't meant to be the best essay. My goal\nhere is to figure out what the best essay would be like.\nIt would be well-written, but you can write well about any topic."
  },
  {
    "title": "HWH",
    "url": "https://paulgraham.com/hwh.html",
    "date": "December 2023",
    "preview": "June 2021\nIt might not seem there's much to learn about how to work hard.\nAnyone who's been to school knows what it entails, even if they\nchose not to do it. There are 12 year olds who work amazingly hard. And"
  },
  {
    "title": "Words",
    "url": "https://paulgraham.com/words.html",
    "date": "November 2023",
    "preview": "February 2022\nWriting about something, even something you know well, usually shows\nyou that you didn't know it as well as you thought. Putting ideas\ninto words is a severe test. The first words you choose are usually"
  },
  {
    "title": "Writes",
    "url": "https://paulgraham.com/writes.html",
    "date": "November 2023",
    "preview": "October 2024\nI'm usually reluctant to make predictions about technology, but I\nfeel fairly confident about this one: in a couple decades there\nwon't be many people who can write."
  },
  {
    "title": "When",
    "url": "https://paulgraham.com/when.html",
    "date": "October 2023",
    "preview": "September 2024\nThere's some debate about whether it's a good idea to \"follow your\npassion.\" In fact the question is impossible to answer with a simple\nyes or no. Sometimes you should and sometimes you shouldn't, but"
  },
  {
    "title": "Weird",
    "url": "https://paulgraham.com/weird.html",
    "date": "October 2023",
    "preview": "August 2021\nWhen people say that in their experience all programming languages\nare basically equivalent, they're making a statement not about\nlanguages but about the kind of programming they've done."
  },
  {
    "title": "Want",
    "url": "https://paulgraham.com/want.html",
    "date": "September 2023",
    "preview": "November 2022\nSince I was about 9 I've been puzzled by the apparent contradiction\nbetween being made of matter that behaves in a predictable way, and\nthe feeling that I could choose to do whatever I wanted. At the"
  },
  {
    "title": "Users",
    "url": "https://paulgraham.com/users.html",
    "date": "September 2023",
    "preview": "September 2022\nI recently told applicants to Y Combinator that the best advice I\ncould give for getting in, per word, was \n  Explain what you've learned from users."
  },
  {
    "title": "Smart",
    "url": "https://paulgraham.com/smart.html",
    "date": "August 2023",
    "preview": "October 2021\nIf you asked people what was special about Einstein, most would say\nthat he was really smart. Even the ones who tried to give you a\nmore sophisticated-sounding answer would probably think this first."
  },
  {
    "title": "Read",
    "url": "https://paulgraham.com/read.html",
    "date": "August 2023",
    "preview": "November 2022\nIn the science fiction books I read as a kid, reading had often\nbeen replaced by some more efficient way of acquiring knowledge.\nMysterious \"tapes\" would load it into one's brain like a program"
  },
  {
    "title": "Persistence",
    "url": "https://paulgraham.com/persistence.html",
    "date": "July 2023",
    "preview": "July 2024\nSuccessful people tend to be persistent. New ideas often don't work\nat first, but they're not deterred. They keep trying and eventually\nfind something that does."
  },
  {
    "title": "Own",
    "url": "https://paulgraham.com/own.html",
    "date": "July 2023",
    "preview": "June 2021\nA few days ago, on the way home from school, my nine year old son\ntold me he couldn't wait to get home to write more of the story he\nwas working on. This made me as happy as anything I've heard him"
  },
  {
    "title": "Heresy",
    "url": "https://paulgraham.com/heresy.html",
    "date": "June 2023",
    "preview": "April 2022\nOne of the most surprising things I've witnessed in my lifetime is\nthe rebirth of the concept of heresy.\nIn his excellent biography of Newton, Richard Westfall writes about the"
  },
  {
    "title": "Good Taste",
    "url": "https://paulgraham.com/goodtaste.html",
    "date": "June 2023",
    "preview": "November 2021\n(This essay is derived from a talk at the Cambridge Union.)\nWhen I was a kid, I'd have said there wasn't. My father told me so.\nSome people like some things, and other people like other things,"
  },
  {
    "title": "Get Ideas",
    "url": "https://paulgraham.com/getideas.html",
    "date": "May 2023",
    "preview": "January 2023\n(\nSomeone\n fed my essays into GPT to make something that could answer"
  },
  {
    "title": "Founder Mode",
    "url": "https://paulgraham.com/foundermode.html",
    "date": "May 2023",
    "preview": "September 2024\nAt a YC event last week Brian Chesky gave a talk that everyone who\nwas there will remember. Most founders I talked to afterward said\nit was the best they'd ever heard. Ron Conway, for the first time"
  },
  {
    "title": "Do",
    "url": "https://paulgraham.com/do.html",
    "date": "April 2023",
    "preview": "March 2025\nWhat should one do? That may seem a strange question, but it's not\nmeaningless or unanswerable. It's the sort of question kids ask\nbefore they learn not to ask big questions. I only came across it"
  },
  {
    "title": "Alien",
    "url": "https://paulgraham.com/alien.html",
    "date": "April 2023",
    "preview": "October 2022\nIf there were intelligent beings elsewhere in the universe, they'd\nshare certain truths in common with us. The truths of mathematics\nwould be the same, because they're true by definition. Ditto for"
  }
]